#include <stdio.h>
#include <locale.h>


int main() {
    setlocale(LC_CTYPE, "RUS");
    int X = 25;
    int S = 150;
    int L = 120;
    float length = S / (L / 100.0); // длина ткани: площадь парусов делим на ширину рулона в метрах (120 см = 1.2 м)
    float price = X * length; // цена погонного метра, умноженная на длину ткани
    printf("Стоимость погонного метра красного шелка стоит %d золотых. Сколько заплатил Грей\nза ткань для своей бригантины, если общая площадь парусов на ней %d м2,\nа ширина ткани в рулоне %d см.\nОтвет: %.2f золотых", X, S, L, price);
    return 0;
}
