#include <stdio.h>
#include <locale.h>


int main() {
    setlocale(LC_CTYPE, "RUS");
    int B = 100;
    int x = 7;
    float S = x * 0.8; // площадь куска: длина x на ширину 0.8 м (80 см)
    float price = B * S; // цена за квадратный метр, умноженная на площадь
    printf("В магазине продается костюмная ткань. Ее цена %d рублей за кв. Метр.\nНапишите программу, которая подсчитает и выведет на экран стоимость куска\nэтой ткани длиной %d м и шириной 80 см.\nОтвет: %.2f рублей", B, x, price);
    return 0;
}
